#+BEGIN_COMMENT
.. title: Pulling Legendary Creatures From Wikipedia
.. slug: pulling-legendary-creatures-from-wikipedia
.. date: 2020-08-06 15:04:35 UTC-07:00
.. tags: wikipedia,scraping,lists
.. category: Scraping
.. link: 
.. description: Pulling a list of legendary creatures from wikipedia.
.. type: text
.. status: 
.. updated: 

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2

#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-605022ca-2ed5-43ff-a01f-f8b41b6b3c17-ssh.json

#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC
*** Tables
    I'll grab all the tables then filter out the ones I don't want - the first three tables are admonitions that the page might not be up to snuff and the last four are references and links to other pages.
#+begin_src python
tables = soup.find_all("table")
tables = tables[3:-4]
print(len(tables))
#+end_src

#+RESULTS:
: 57
